tutorials/multiphase/interIsoFoam/discInReversedVortexFlow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        boxes
        (
            (0.1 -1e10 0.08) (0.9 1e10 0.2)
            (0.75 -1e10 0.2) (0.92 1e10 0.9)
            (0.1 -1e10 0.2) (0.25 1e10 0.7)
        );
    }
);

// ************************************************************************* //
